import { IGame } from "./store/gameConfigSlice";

export const games: IGame[] = [
  {
    title: "Музей",
    roles: [
      "Охранник музея",
      "Уборщик музея",
      "Директор музея",
      "Смотритель музея",
      "Экскурсовод музея",
      "Посетитель музея",
    ],
    answerOptionsForSpyTest: ["Музей", "Больница"],
  },
  // {
  //   title: "Больница",
  //   roles: [
  //     "Медсестра",
  //     "Врач",
  //     "Зав отделения",
  //     "Пациент",
  //     "Медбрат",
  //     "Невролог",
  //   ],
  //   answerOptionsForSpyTest: [],
  // },
  // {
  //   title: "Торговый центр",
  //   roles: [
  //     "Охранник торгового центра",
  //     "Продавец торгового центра",
  //     "Директор торгового центра",
  //     "Управляющий торгового центра",
  //     "Работник торгового центра",
  //     "Аниматор торгового центра",
  //   ],
  //   answerOptionsForSpyTest: [],
  // },
];
